<template lang="html">
    <div id="load">
        <!--存放百度地图容器-->
        <div id="container"></div>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                // 热力图的点数据，lng：点的经度 点的lat纬度 count：点的热力程度
                points: [

                    {"lng":123.422766,"lat":41.821408,"count":25},
                    {"lng":123.421674,"lat":41.824396,"count":21},
                    {"lng":123.427268,"lat":41.82267,"count":1},
                    {"lng":123.417721,"lat":41.820034,"count":51},
                    {"lng":123.412456,"lat":41.82667,"count":7},
                    {"lng":123.420432,"lat":41.819114,"count":11},
                    {"lng":123.425013,"lat":41.821611,"count":35},
                    {"lng":123.418733,"lat":41.831037,"count":22},
                    {"lng":123.419336,"lat":41.831134,"count":4},
                    {"lng":123.413557,"lat":41.823254,"count":5},
                    {"lng":123.418367,"lat":41.82943,"count":3},
                    {"lng":123.424312,"lat":41.919621,"count":100},
                    {"lng":123.423874,"lat":41.919447,"count":87},
                    {"lng":123.424225,"lat":41.823091,"count":32},
                    {"lng":123.417801,"lat":41.821854,"count":44},
                    {"lng":123.417129,"lat":41.828227,"count":21},
                    {"lng":123.426426,"lat":41.822286,"count":80},
                    {"lng":123.421597,"lat":41.81948,"count":32},
                    {"lng":123.423895,"lat":41.920787,"count":26},
                    {"lng":123.423563,"lat":41.921197,"count":17},
                    {"lng":123.417982,"lat":41.922547,"count":17},
                    {"lng":123.426126,"lat":41.821938,"count":25},
                    {"lng":123.42326,"lat":41.885782,"count":100},
                    {"lng":123.419239,"lat":41.916759,"count":41},
                    {"lng":123.417185,"lat":41.929123,"count":11},
                    {"lng":123.417237,"lat":41.927518,"count":9},
                    {"lng":123.417784,"lat":41.815754,"count":47},
                    {"lng":123.420193,"lat":41.817061,"count":52},
                    {"lng":123.422735,"lat":41.815619,"count":100},
                    {"lng":123.418495,"lat":41.815958,"count":46},
                    {"lng":123.416292,"lat":41.831166,"count":9},
                    {"lng":123.419916,"lat":41.824055,"count":8},
                    {"lng":123.42189,"lat":41.71308,"count":11},
                    {"lng":123.413765,"lat":41.729376,"count":3},
                    {"lng":123.418232,"lat":41.7720348,"count":50},
                    {"lng":123.417554,"lat":41.730511,"count":15},
                    {"lng":123.418568,"lat":41.718161,"count":23},
                    {"lng":123.413461,"lat":41.726306,"count":3},
                    {"lng":123.42232,"lat":41.7161,"count":13},
                    {"lng":123.4174,"lat":41.78616,"count":6},
                    {"lng":123.424679,"lat":41.715499,"count":21},
                    {"lng":123.42171,"lat":41.75738,"count":29},
                    {"lng":123.417836,"lat":41.716998,"count":99},
                    {"lng":123.420755,"lat":41.728001,"count":10},
                    {"lng":123.414077,"lat":41.730655,"count":14},
                    {"lng":123.426092,"lat":41.722995,"count":16},
                    {"lng":123.41535,"lat":41.731054,"count":15},
                    {"lng":123.413022,"lat":41.721895,"count":13},
                    {"lng":123.415551,"lat":41.713373,"count":17},
                    {"lng":123.421191,"lat":41.726572,"count":1},
                    {"lng":123.419612,"lat":41.717119,"count":9},
                    {"lng":123.418237,"lat":41.721337,"count":54},
                    {"lng":123.423776,"lat":41.721919,"count":26},
                    {"lng":123.417694,"lat":41.72536,"count":17},
                    {"lng":123.415377,"lat":41.714137,"count":19},
                    {"lng":123.417434,"lat":41.714394,"count":43},
                    {"lng":123.42588,"lat":41.72622,"count":27},
                    {"lng":123.418345,"lat":41.719467,"count":8},
                    {"lng":123.426883,"lat":41.717171,"count":3},
                    {"lng":123.423877,"lat":41.716659,"count":34},
                    {"lng":123.415712,"lat":41.915613,"count":14},
                    {"lng":123.419869,"lat":41.931416,"count":12},
                    {"lng":123.416956,"lat":41.925377,"count":11},
                    {"lng":123.42066,"lat":41.925017,"count":38},
                    {"lng":123.416244,"lat":41.920215,"count":91},
                    {"lng":123.41929,"lat":41.915908,"count":54},
                    {"lng":123.422116,"lat":41.619658,"count":21},
                    {"lng":123.4183,"lat":41.625015,"count":15},
                    {"lng":123.421969,"lat":41.613527,"count":3},
                    {"lng":123.422936,"lat":41.621854,"count":24},
                    {"lng":123.41905,"lat":41.629217,"count":12},
                    {"lng":123.424579,"lat":41.614987,"count":57},
                    {"lng":123.42076,"lat":41.615251,"count":70},
                    {"lng":123.425867,"lat":41.618989,"count":8},
                    {"lng":123.518261,"lat":41.621984,"count":50},
                    {"lng":123.523332,"lat":41.616532,"count":51},
                    {"lng":123.519787,"lat":41.630658,"count":15},
                    {"lng":123.518455,"lat":41.620921,"count":40},
                    {"lng":123.518843,"lat":41.615516,"count":100},
                    {"lng":123.52546,"lat":41.68503,"count":6},
                    {"lng":123.523289,"lat":41.619989,"count":18},
                    {"lng":123.518162,"lat":41.615051,"count":80},
                    {"lng":123.522039,"lat":41.61782,"count":11},
                    {"lng":123.51387,"lat":41.617253,"count":7},
                    {"lng":123.51773,"lat":41.619426,"count":42},
                    {"lng":123.521107,"lat":41.616445,"count":4},
                    {"lng":123.517521,"lat":41.617943,"count":27},
                    {"lng":123.519812,"lat":41.920836,"count":23},
                    {"lng":123.520682,"lat":41.91463,"count":60},
                    {"lng":123.515424,"lat":41.924675,"count":8},
                    {"lng":123.519242,"lat":41.914509,"count":15},
                    {"lng":123.475712,"lat":41.915613,"count":14},
                    {"lng":123.489869,"lat":41.931416,"count":12},
                    {"lng":123.476956,"lat":41.925377,"count":11},
                    {"lng":123.48066,"lat":41.925017,"count":38},
                    {"lng":123.456244,"lat":41.920215,"count":91},
                    {"lng":123.46929,"lat":41.615908,"count":54},
                    {"lng":123.442116,"lat":41.619658,"count":21},
                    {"lng":123.4483,"lat":41.625015,"count":15},
                    {"lng":123.471969,"lat":41.613527,"count":3},
                    {"lng":123.472936,"lat":41.921854,"count":24},
                    {"lng":123.48905,"lat":41.629217,"count":12},
                    {"lng":123.494579,"lat":41.614987,"count":57},

                    {"lng":123.46076,"lat":41.615251,"count":70},
                    {"lng":123.465867,"lat":41.618989,"count":8},
                    {"lng":123.375712,"lat":41.615613,"count":14},
                    {"lng":123.389869,"lat":41.631416,"count":12},
                    {"lng":123.376956,"lat":41.625377,"count":11},
                    {"lng":123.38066,"lat":41.65017,"count":38},
                    {"lng":123.356244,"lat":41.920215,"count":91},
                    {"lng":123.36929,"lat":41.915908,"count":54},
                    {"lng":123.342116,"lat":41.919658,"count":21},
                    {"lng":123.3483,"lat":41.925015,"count":15},
                    {"lng":123.371969,"lat":41.913527,"count":3},
                    {"lng":123.372936,"lat":41.921854,"count":24},
                    {"lng":123.38905,"lat":41.929217,"count":12},
                    {"lng":123.394579,"lat":41.914987,"count":57},
                    {"lng":123.36076,"lat":41.915251,"count":70},
                    {"lng":123.365867,"lat":41.918989,"count":8},
                    {"lng":123.36076,"lat":41.915251,"count":70},
                    {"lng":123.365867,"lat":41.918989,"count":8},
                    {"lng":123.325712,"lat":41.915613,"count":14},
                    {"lng":123.339869,"lat":41.931416,"count":12},
                    {"lng":123.346956,"lat":41.925377,"count":11},
                    {"lng":123.32066,"lat":41.925017,"count":38},
                    {"lng":123.336244,"lat":41.920215,"count":91},
                    {"lng":123.34929,"lat":41.915908,"count":54},
                    {"lng":123.312116,"lat":41.919658,"count":21},
                    {"lng":123.3083,"lat":41.925015,"count":15},
                    {"lng":123.321969,"lat":41.913527,"count":3},
                    {"lng":123.342936,"lat":41.921854,"count":24},
                    {"lng":123.33905,"lat":41.929217,"count":12},
                    {"lng":123.324579,"lat":41.914987,"count":57},
                    {"lng":123.35076,"lat":41.915251,"count":70},
                    {"lng":123.295867,"lat":41.918989,"count":8},
                    {"lng":123.296956,"lat":41.925377,"count":11},
                    {"lng":123.28066,"lat":41.725017,"count":38},
                    {"lng":123.276244,"lat":41.720215,"count":91},
                    {"lng":123.29929,"lat":41.715908,"count":54},
                    {"lng":123.272116,"lat":41.719658,"count":21},
                    {"lng":123.2683,"lat":41.725015,"count":15},
                    {"lng":123.261969,"lat":41.713527,"count":3},
                    {"lng":123.252936,"lat":41.721854,"count":24},
                    {"lng":123.27905,"lat":41.729217,"count":12},
                    {"lng":123.244579,"lat":41.714987,"count":57},
                    {"lng":123.26076,"lat":41.715251,"count":70},
                    {"lng":123.235867,"lat":41.718989,"count":8},
                    {"lng":123.46076,"lat":41.755251,"count":70},
                    {"lng":123.465867,"lat":41.768989,"count":8},
                    {"lng":123.375712,"lat":41.775613,"count":14},
                    {"lng":123.389869,"lat":41.741416,"count":12},
                    {"lng":123.376956,"lat":41.735377,"count":11},
                    {"lng":123.38066,"lat":41.755017,"count":38},
                    {"lng":123.356244,"lat":41.740215,"count":91},
                    {"lng":123.36929,"lat":41.725908,"count":54},
                    {"lng":123.342116,"lat":41.739658,"count":21},
                    {"lng":123.3483,"lat":41.805015,"count":15},
                    {"lng":123.371969,"lat":41.803527,"count":3},
                    {"lng":123.372936,"lat":41.801854,"count":24},
                    {"lng":123.38905,"lat":41.869217,"count":12},
                    {"lng":123.394579,"lat":41.804987,"count":57},
                    {"lng":123.36076,"lat":41.805251,"count":70},
                    {"lng":123.365867,"lat":41.808989,"count":8},
                    {"lng":123.36076,"lat":41.755251,"count":70},
                    {"lng":123.365867,"lat":41.838989,"count":8},
                    {"lng":123.34066,"lat":41.855017,"count":38},
                    {"lng":123.386244,"lat":41.850215,"count":91},
                    {"lng":123.55929,"lat":41.825908,"count":54},
                    {"lng":123.342116,"lat":41.739658,"count":21},
                    {"lng":123.6083,"lat":41.605015,"count":15},
                    {"lng":123.551969,"lat":41.673527,"count":3},
                    {"lng":123.532936,"lat":41.561854,"count":24},
                    {"lng":123.54905,"lat":41.869217,"count":12},
                    {"lng":123.524579,"lat":41.504987,"count":57},
                    {"lng":123.36076,"lat":41.785251,"count":70},
                    {"lng":123.365867,"lat":41.678989,"count":8},
                    {"lng":123.36076,"lat":41.455251,"count":70},
                    {"lng":123.365867,"lat":41.378989,"count":8},
                    {"lng":123.286244,"lat":41.620215,"count":91},
                    {"lng":123.25929,"lat":41.505908,"count":54},
                    {"lng":123.242116,"lat":41.539658,"count":21},
                    {"lng":123.2083,"lat":41.405015,"count":15},
                    {"lng":123.351969,"lat":41.373527,"count":3},
                    {"lng":123.232936,"lat":41.561854,"count":24},
                    {"lng":123.24905,"lat":41.869217,"count":12},
                    {"lng":123.224579,"lat":41.504987,"count":57},
                    {"lng":123.16076,"lat":41.785251,"count":70},
                    {"lng":123.365867,"lat":41.678989,"count":8},
                    {"lng":123.56076,"lat":41.455251,"count":70},
                    {"lng":123.465867,"lat":41.378989,"count":8},
                    {"lng":123.96244,"lat":41.820215,"count":91},
                    {"lng":123.895929,"lat":41.705908,"count":54},
                    {"lng":123.942116,"lat":41.539658,"count":21},
                    {"lng":123.8083,"lat":41.905015,"count":15},
                    {"lng":123.451969,"lat":41.573527,"count":3},
                    {"lng":123.332936,"lat":41.661854,"count":24},
                    {"lng":123.54905,"lat":41.709217,"count":12},
                    {"lng":123.624579,"lat":41.7704987,"count":57},
                    {"lng":123.46076,"lat":41.785251,"count":70},
                    {"lng":123.365867,"lat":41.758989,"count":8},
                    {"lng":123.96076,"lat":41.705251,"count":70},
                    {"lng":123.865867,"lat":41.708989,"count":8},
                    {"lng":123.28066,"lat":41.825017,"count":38},
                    {"lng":123.276244,"lat":41.820215,"count":91},
                    {"lng":123.29929,"lat":41.815908,"count":54},
                    {"lng":123.272116,"lat":41.819658,"count":21},
                    {"lng":123.2683,"lat":41.825015,"count":15},
                    {"lng":123.261969,"lat":41.813527,"count":3},
                    {"lng":123.252936,"lat":41.821854,"count":24},
                    {"lng":123.27905,"lat":41.829217,"count":12},
                    {"lng":123.244579,"lat":41.814987,"count":57},
                    {"lng":123.26076,"lat":41.815251,"count":70},
                    {"lng":123.235867,"lat":41.818989,"count":8},
                ],
                map: '',// 保存地图实例
                centerLng: '123.418261', // 经度
                centerLat: '41.7021984', // 纬度
                heatmapOverlay: {},// 热力图覆盖物
            }
        },
        methods: {
            // 创建和初始化地图函数
            initMap(){
                this.createMap();// 创建地图
                this.initHeatMap();// 添加热力图覆盖物
            },
            // 方法 - 创建地图
            createMap(){
                // 在百度地图容器中创建地图实例
                let map = new BMap.Map("container");
                // 将map变量存储在全局
                this.map = map;
                // 设定地图的中心点和坐标
                let point = new BMap.Point(this.centerLng, this.centerLat);
                // 设置中心点坐标和地图级别
                this.map.centerAndZoom(point, 15);
                // 允许滚轮缩放
                this.map.enableScrollWheelZoom(point, 15);
                // 添加左上角缩放比例尺(offset: new BMap.Size(0, 0)为比例尺的坐标位置)
                var opts = {offset: new BMap.Size(10, 10)}
                this.map.addControl(new BMap.NavigationControl(opts));
                // 设置地图默认缩放比例
                this.map.setZoom(10);
            },
            // 方法 - 添加热力图覆盖物
            initHeatMap () {
                this.heatmapOverlay = new BMapLib.HeatmapOverlay({
                    // 热力图的每个点的半径大小
                    'radius': BMAP_POINT_SIZE_SMALL * 4,
                    // 热力的透明度0~1
                    'opacity': 0.9,
                    // 其中 key 表示插值的位置0~1，value 为颜色值
                    'gradient': {
                        0:'rgb(102, 255, 0)',
                        .5:'rgb(255, 170, 0)',
                        1:'rgb(255, 0, 0)'
                    }
                })
                // 清除图层(每次重新调用需要清除上一个覆盖物图层)
                this.map.clearOverlays();
                // 添加热力覆盖物
                this.map.addOverlay(this.heatmapOverlay);
                this.heatmapOverlay.setDataSet({data: this.points, max: 100});
                // 显示热力图，隐藏为this.heatmapOverlay.hide();
                this.heatmapOverlay.show();
            }
        },
        mounted() {
            // 创建和初始化地图函数
            this.initMap();
        }
    }
</script>

<style >
    #load {
        width: 100%;
        height: 430px;
    }
    #container {
        width: 100%;
        height: 430px;
        border: #ccc solid 1px;
    }
</style>